{
  "add_faster_video": false,
  "architectures": [
    "Qwen3VLForConditionalGeneration"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 151643,
  "delay_load": true,
  "eos_token_id": 151645,
  "faster_token_stride": 10,
  "force_sample": true,
  "freeze_mm_mlp_adapter": true,
  "hidden_act": "silu",
  "hidden_size": 4096,
  "ignore_index": -100,
  "initializer_range": 0.02,
  "intermediate_size": 12288,
  "max_position_embeddings": 32768,
  "max_window_layers": 28,
  "model_type": "qwen3_vl",
  "num_attention_heads": 32,
  "num_future_steps": 4,
  "num_hidden_layers": 36,
  "num_history": 8,
  "num_key_value_heads": 4,
  "pos_skipping_range": 4096,
  "pretrain_mm_mlp_adapter": null,
  "projector_hidden_act": "gelu",
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "sliding_window": 131072,
  "text_config": {
    "attention_bias": false,
    "attention_dropout": 0.0,
    "bos_token_id": 151643,
    "dtype": "bfloat16",
    "eos_token_id": 151645,
    "head_dim": 128,
    "hidden_act": "silu",
    "hidden_size": 2560,
    "initializer_range": 0.02,
    "intermediate_size": 9728,
    "max_position_embeddings": 262144,
    "model_type": "qwen3_vl_text",
    "num_attention_heads": 32,
    "num_hidden_layers": 36,
    "num_key_value_heads": 8,
    "rms_norm_eps": 1e-06,
    "rope_scaling": {
      "mrope_interleaved": true,
      "mrope_section": [
        24,
        20,
        20
      ],
      "rope_type": "default"
    },
    "rope_theta": 5000000,
    "tie_word_embeddings": true,
    "transformers_version": "4.57.0",
    "use_cache": true,
    "vocab_size": 151936
  },
  "tie_word_embeddings": true,
  "tokenizer_model_max_length": 32768,
  "tokenizer_padding_side": "right",
  "torch_dtype": "bfloat16",
  "transformers_version": "4.57.0.dev0",
  "tune_mm_mlp_adapter": false,
  "use_mm_proj": true,
  "use_pos_skipping": false,
  "use_sliding_window": false,
  "vision_config": {
    "deepstack_visual_indexes": [
      5,
      11,
      17
    ],
    "depth": 24,
    "hidden_act": "gelu_pytorch_tanh",
    "hidden_size": 1024,
    "in_channels": 3,
    "initializer_range": 0.02,
    "intermediate_size": 4096,
    "model_type": "qwen3_vl",
    "num_heads": 16,
    "num_position_embeddings": 2304,
    "out_hidden_size": 2560,
    "patch_size": 16,
    "spatial_merge_size": 2,
    "temporal_patch_size": 2
  },
  "image_token_id": 151655,
  "video_token_id": 151656,
  "vision_start_token_id": 151652,
  "vision_end_token_id": 151653
}